{
  "_attn_implementation_autoset": true,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "earnings_guidance",
    "1": "corporate_action_mna",
    "2": "management_change",
    "3": "legal_regulatory",
    "4": "financing_restructuring",
    "5": "other_actionable"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "corporate_action_mna": 1,
    "earnings_guidance": 0,
    "financing_restructuring": 4,
    "legal_regulatory": 3,
    "management_change": 2,
    "other_actionable": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
